Revit 2026 API

# XYZUnaryNegation Operator

---

Negates the specified vector and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ operator -(
	XYZ source
)
```
```vb
Public Shared Operator - (
	source As XYZ
) As XYZ
```
```cpp
public:
static XYZ^ operator -(
	XYZ^ source
)
```
```fsharp
static let inline (-)
        source : XYZ  : XYZ
```

#### Parameters

source XYZ

#### Return Value

XYZThe vector opposite to the specified vector.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The negated vector is obtained by changing the sign of each coordinate of the specified vector.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace